{
  "heat": {
    "patient_friendly": "It feels like something is burning or overheating deep inside your pelvis — like fire under the skin.",
    "likely_mechanism": "inflammatory response, hormonal heat sensitivity, or tissue irritation",
    "clinical_terms": ["dysmenorrhea", "pelvic hyperemia", "endometrial inflammation"]
  },
  "cutting_tools": {
    "patient_friendly": "It feels like something sharp — like a knife or blade — is slicing or piercing your internal organs.",
    "likely_mechanism": "localized nerve sensitization or referred visceral pain",
    "clinical_terms": ["neuropathic pain", "visceral hypersensitivity", "sharp pelvic pain"]
  },
  "predator": {
    "patient_friendly": "It feels like something living is attacking from inside — clawing, tearing, or threatening to re-emerge.",
    "likely_mechanism": "psychosomatic pain memory or central sensitization with affective overload",
    "clinical_terms": ["central sensitization", "pain catastrophizing", "referred pelvic distress"]
  },
  "birth_labour": {
    "patient_friendly": "It feels like you're in labor — with intense waves of pressure and the sensation of pushing or giving birth.",
    "likely_mechanism": "strong uterine contractions or visceral cramping during menstruation or bowel movements",
    "clinical_terms": ["dysmenorrhea", "tenesmus", "pelvic organ dysfunction"]
  },
  "constriction_pressure": {
    "patient_friendly": "It feels like something is gripping, squeezing, or compressing your organs — like being trapped from the inside.",
    "likely_mechanism": "pelvic floor tension, inflammation-induced swelling, or intestinal obstruction",
    "clinical_terms": ["myofascial pain", "visceral hypersensitivity", "internal compression syndrome"]
  },
  "lingering_force": {
    "patient_friendly": "It feels like there's always something there — simmering, whispering, pressing — not acute, but never gone.",
    "likely_mechanism": "low-grade chronic inflammation or background neural activation",
    "clinical_terms": ["chronic pelvic pain", "ongoing discomfort", "latent inflammation"]
  },
  "electric_force": {
    "patient_friendly": "It feels like sharp jolts, shocks, or zaps of pain that come out of nowhere — like electricity running through your nerves.",
    "likely_mechanism": "nerve hyperexcitability or neuropathic pain flares",
    "clinical_terms": ["neuropathic pain", "nerve hypersensitivity", "neuralgia"]
  },
  "violent_action": {
    "patient_friendly": "It feels like being physically attacked from the inside — stabbed, punched, or beaten by an invisible force.",
    "likely_mechanism": "acute pain spikes linked to tissue inflammation or central sensitization",
    "clinical_terms": ["breakthrough pain", "central sensitization", "visceral assault"]
  },
  "weight_burden": {
    "patient_friendly": "It feels like carrying something heavy inside your body — dragging, pressing, and exhausting.",
    "likely_mechanism": "pelvic organ pressure, inflammatory swelling, or musculoskeletal strain",
    "clinical_terms": ["pelvic heaviness", "myofascial pain", "fatigue-related pressure"]
  },
  "entrapment": {
    "patient_friendly": "It feels like you're stuck in a cage of pain — trapped, compressed, and unable to escape.",
    "likely_mechanism": "chronic looping pain pathways or pelvic floor dysfunction",
    "clinical_terms": ["visceral entrapment", "pain loop", "pelvic floor tension"]
  },
  "transformation_distortion": {
    "patient_friendly": "It feels like the pain changes who you are — like you're outside yourself, disconnected or not fully in your body.",
    "likely_mechanism": "dissociative coping, identity disturbance, or sensory-motor dysregulation",
    "clinical_terms": ["dissociation", "depersonalization", "chronic pain-induced identity disruption"]
  },
  "internal_machinery": {
    "patient_friendly": "It feels like there are gears, metal parts, or grinding machines inside you — a cold, unnatural sensation of something mechanical working against your body.",
    "likely_mechanism": "visceral tension, scar tissue pulling, or pelvic adhesions",
    "clinical_terms": ["adhesions", "visceral traction", "pelvic scarring"]
  }
}
